Процедура ДополнитьФорму (Форма) Экспорт   
	
	ИмяФормы  = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо(Форма); 	
		ДобавитьПолеСкидка(Форма);
		ДобавитьКоманду(Форма);  
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента"     Тогда
		ДобавитьПолеКонтактноеЛицо(Форма);	  
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента"     Тогда
		ДобавитьПолеКонтактноеЛицо(Форма);	
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента"     Тогда
		ВставитьПолеКонтактноеЛицо(Форма);	
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента"     Тогда
		ВставитьПолеКонтактноеЛицо(Форма);	 
	КонецЕсли;
	
КонецПроцедуры  


Процедура ДобавитьПолеКонтактноеЛицо (Форма)    

   ПолеВвода = Форма.Элементы.Добавить ("КонтактноеЛицо", тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
   ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
   ПолеВвода.ПутьКДанным = "Объект.СИБ_КонтактноеЛицо";
	
КонецПроцедуры  

Процедура ВставитьПолеКонтактноеЛицо (Форма)    

   ПолеВвода = Форма.Элементы.Вставить ("КонтактноеЛицо", тип("ПолеФормы"), ,Форма.Элементы.СуммаДокумента);
   ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
   ПолеВвода.ПутьКДанным = "Объект.СИБ_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьПолеСкидка (Форма)    

   Группа = Форма.Элементы.Добавить ("ГруппаСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);  
   Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
   
   ПолеВвода = Форма.Элементы.Добавить ("Скидка", Тип("ПолеФормы"),Форма.Элементы.ГруппаСкидка);  
   ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
   ПолеВвода.ПутьКДанным = "Объект.СИБ_СогласованнаяСкидка";
   ПолеВвода.УстановитьДействие ("ПриИзменении", "СкидкаПриИзменении");
	
КонецПроцедуры    

Процедура ДобавитьКоманду (Форма)    
	
	Если Форма.Элементы.Найти ("КнопкаПересчитатьСуммуСоСкидкой") = Неопределено Тогда   
		
		// Создание команды
	
	КомандаПересчитатьСуммуСоСкидкой = Форма.Команды.Добавить ("ПересчитатьСуммуСоСкидкой");  
	КомандаПересчитатьСуммуСоСкидкой.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КомандаПересчитатьСуммуСоСкидкой.Картинка = БиблиотекаКартинок.Обновить; 
	КомандаПересчитатьСуммуСоСкидкой.Заголовок = "Пересчитать сумму со скидкой ";
	КомандаПересчитатьСуммуСоСкидкой.Действие = "ПересчитатьСуммуСоСкидкой";   
	
	// Создание элемента формы
	
    КнопкаПересчитатьСуммуСоСкидкой  = Форма.Элементы.Добавить ("ПересчитатьСуммуСоСкидкой", Тип("КнопкаФормы"),Форма.Элементы.ГруппаСкидка); 
	КнопкаПересчитатьСуммуСоСкидкой.ИмяКоманды  = "ПересчитатьСуммуСоСкидкой";	
	КнопкаПересчитатьСуммуСоСкидкой.Вид  = ВидКнопкиФормы.ОбычнаяКнопка;	
	
КонецЕсли;

КонецПроцедуры 
