Процедура ДополнитьФорму (Форма) Экспорт   
	
	ИмяФормы  = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо(Форма); 	
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента"     Тогда
		ДобавитьПолеКонтактноеЛицо(Форма);	  
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента"     Тогда
		ДобавитьПолеКонтактноеЛицо(Форма);	
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента"     Тогда
		ВставитьПолеКонтактноеЛицо(Форма);	
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента"     Тогда
		ВставитьПолеКонтактноеЛицо(Форма);	 
	КонецЕсли;
	
КонецПроцедуры  


Процедура ДобавитьПолеКонтактноеЛицо (Форма)    

   ПолеВвода = Форма.Элементы.Добавить ("КонтактноеЛицо", тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
   ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
   ПолеВвода.ПутьКДанным = "Объект.СИБ_КонтактноеЛицо";
	
КонецПроцедуры  

Процедура ВставитьПолеКонтактноеЛицо (Форма)    

   ПолеВвода = Форма.Элементы.Вставить ("КонтактноеЛицо", тип("ПолеФормы"), ,Форма.Элементы.СуммаДокумента);
   ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
   ПолеВвода.ПутьКДанным = "Объект.СИБ_КонтактноеЛицо";
	
КонецПроцедуры

