
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	
	// ++ Татьяна: пересчет суммы с учетом скидки

	//ДЗ к занятию "Командная работа (EDT)" 06.10.26  
	
  //Исходный код:	
    //КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
 //Новый код:
 	СуммаСкидок = Объект.СИБ_СогласованнаяСкидка +  ТекущиеДанные.Скидка;    
	Если СуммаСкидок >100 Тогда
		СуммаСкидок = 100;
		Сообщить("Сумма скидок не должна превышать 100%");
	КонецЕсли;
	
	КоэффициентСкидки = 1 - СуммаСкидок / 100;
	ТекущиеДанные.Сумма =  ТекущиеДанные.Количество * ТекущиеДанные.Цена * КоэффициентСкидки;
	РассчитатьСуммуДокумента();  
 	
	// -- Татьяна: пересчет суммы с учетом скидки 06.10.26
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область КомандФормы 
// ++ Татьяна: Работа с командой
//ДЗ к занятию "Командная работа (EDT)" 06.10.26   

&НаКлиенте
Процедура ПересчитатьСуммуСоСкидкой(Команда) 
	
	ПересчетСуммыСУчетомСкидкиТовары();
	ПересчетСуммыСУчетомСкидкиУслуги();
	
КонецПроцедуры    


&НаКлиенте
Процедура ПересчетСуммыСУчетомСкидкиТовары() 
	
	Для каждого Строка  Из Объект.Товары Цикл
		
		РассчитатьСуммуСтроки(Строка);
		
	КонецЦикла	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПересчетСуммыСУчетомСкидкиУслуги()   

	Для каждого Строка  Из Объект.Услуги Цикл
		
		РассчитатьСуммуСтроки(Строка);
		
	КонецЦикла	
	
КонецПроцедуры 

&НаКлиенте
Асинх Процедура СкидкаПриИзменении(Элемент)
	
	Если Объект.Товары.Количество() = 0  И Объект.Услуги.Количество() = 0  Тогда
		Возврат;	
	КонецЕсли;	
	
	ВариантОтвета = Новый СписокЗначений;
	ВариантОтвета.Вставить(0,0,"Да");
	ВариантОтвета.Вставить(1,1,"Нет"); 
	
	ТекстВопроса = "Пересчитать сумму с учетом скидки?";
	ОтветПользователя = Ждать ВопросАсинх(ТекстВопроса,ВариантОтвета);
	
	Если ОтветПользователя = 1 Тогда
		Возврат;
	Иначе
		ПересчетСуммыСУчетомСкидкиТовары();   
		ПересчетСуммыСУчетомСкидкиУслуги(); 
	КонецЕсли;
	
КонецПроцедуры
                  

// -- Татьяна: Работа с командой 16.08.26

#КонецОбласти
